#+title: Tarot
#+date: 2025-06-21
#+startup: content

Tarot is quick, but thorough project for dealing with Tarot cards. Using Haskell's powerful type system, we can build a project that effectively describes what Tarot /is/ more than how to use it. It makes for an intuitive way of handling Tarot cards, and is easily extensible.

It's also a modest literate programming and Type-Driven Development project, the real scope of this project. The literate source may be found in [[file:README.org][README.org]].

** Building

Tarot can be built using ~cabal~ with a minimum of GHC 9.10.1. It requires the =random= library (>= v1.3.1):

#+begin_src sh :results verbatim :exports code
cabal build
#+end_src

#+RESULTS:
: Resolving dependencies...
: Build profile: -w ghc-9.10.1 -O1
: In order, the following will be built (use -v for more details):
:  - Tarot-1.0.0 (exe:tarot) (first run)
: Configuring executable 'tarot' for Tarot-1.0.0...
: Preprocessing executable 'tarot' for Tarot-1.0.0...
: Building executable 'tarot' for Tarot-1.0.0...
: [1 of 1] Compiling Main             ( Tarot.hs, dist-newstyle/build/x86_64-linux/ghc-9.10.1/Tarot-1.0.0/x/tarot/build/tarot/tarot-tmp/Main.o )
: [2 of 2] Linking dist-newstyle/build/x86_64-linux/ghc-9.10.1/Tarot-1.0.0/x/tarot/build/tarot/tarot

The options used to construct the application are handled by ~cabal~, and mostly just indicate the compiler version I've used.

#+begin_src haskell-cabal :tangle Tarot.cabal :eval no :exports code
cabal-version: 3.12
name: Tarot
version: 1.0.0

executable tarot
    main-is: Tarot.hs
    build-depends:
      , base   ^>=4.20.0.0
      , random ^>=1.3.1
      -- ^ License included in NOTICE
    default-language: GHC2021
#+end_src


